code_stock_app/app/views/posts/show.html.erb

<% if @current_user.present? && (@post.user_id != @current_user.id) %>
  <% unless @current_user.library.posts.include? @post %>
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."user_id" = $1 LIMIT 1
SELECT "posts".* FROM "posts" INNER JOIN "libraries_posts" ON "posts"."id" = "libraries_posts"."post_id" WHERE "libraries_posts"."library_id" = $1 AND "posts"."id" = $2


<% @author = User.find(@post.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1