app/views/libraries/show_post.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1
---

<% @author = User.find(@post.user_id) %>