app/views/libraries/show_image.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 33]]
---

<% @author = User.find(@image.user_id) %>