code_stock_app/app/controllers/libraries_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 30]]
---
  def show

    user = User.find @current_user.id

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def add
    post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def remove
    lib_entry = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 16]]
---
   def remove_from_lib
    lib_entry = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def show_post
    # needs to show the particular post
    @post = Post.find params[:id]