code_stock_app/app/controllers/session_controller.rb

  def create
    # return params.inspect
    user = User.find_by :name => params[:username]
---
SELECT  "users".* FROM "users" WHERE "users"."name" = 'admin' LIMIT 1