code_stock_app/app/controllers/users_controller.rb

  def create
    @user = User.create user_params

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"