code_stock_app/app/controllers/users_controller.rb

  def update
    # it already saves the values if they're in there but then it doesn't save what the user types in the
    # text boxes
    # this bit is wrong and breaking shit. params[:whatever] is empty so it's saving empty fields
    # it needs to find the right user and update THEM, not the current user
    # raise params.inspect
    @user = User.find params[:id]
    # fix - params were trapped inside user hash and needed to be rescued with another layer of hash exploration
    @user.update(:image => params[:user][:image], :bio => params[:user][:bio])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "users" SET "image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image", "http://xaxor.com/images/Tom-Hanks-is-a-lot-of-animals-meme/Tom-Hanks-is-a-lot-of-animals-meme19.jpg"], ["updated_at", "2015-02-08 01:49:42.117466"], ["id", 13]]

  def create
    @user = User.create user_params

    ### fuck yes ###
    # initialises a new library for each new user (need to wipe/change the seeds to make sure they get one too)
    # proved in pry when User.last.library.posts => []
    @library = Library.create(:user_id => params[:id])
    @user.library = @library

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "libraries" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"
UPDATE "libraries" SET "user_id" = $1, "updated_at" = $2 WHERE "libraries"."id" = $3