app/views/posts/index.html.erb

  <% @posts.each do |post| %>
  <% @author = User.find(post.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1