app/views/posts/show.html.erb

<h2><%= @post.title %></h2>
<% @author = User.find(@post.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1