app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3
---
  def create
    comment = Comment.create comment_params
    comment.update(:user_id => @current_user.id)
    comment.update(:post_id => params[:comment][:post_page_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = $1
---
  def destroy
    comment = Comment.find_by(:post_id => params[:id])
    post_id = comment.post_id
    comment.destroy