app/controllers/images_controller.rb

  def show
    @image = Image.find params[:id]
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1

  def create
    @image = Image.create image_params
    @image.update(:user_id => @current_user.id)
---
INSERT INTO "images" ("title", "source", "description", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "images" SET "user_id" = $1, "updated_at" = $2 WHERE "images"."id" = $3

  def edit
    @image = Image.find params[:id]
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1

  def update
    image = Image.find params[:id]
    image.update image_params
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1
UPDATE "images" SET "title" = $1, "updated_at" = $2 WHERE "images"."id" = $3

  def destroy
    image = Image.find params[:id]
    image.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 10]]