app/controllers/libraries_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 30]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY "posts"."title" ASC  [["user_id", 37]]
SELECT "images".* FROM "images" INNER JOIN "images_libraries" ON "images"."id" = "images_libraries"."image_id" WHERE "images_libraries"."library_id" = $1 AND ("images"."user_id" != $2)  [["library_id", 12], ["user_id", 33]]
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."user_id" = $1 LIMIT 1
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def show
    user = User.find @current_user.id
    @user_posts = user.posts.order(:title)
    @favourite_posts = user.library.posts.where.not(:user_id => @current_user.id).order(:title)

    @user_images = user.images
    @favourite_images = user.library.images.where.not(:user_id => @current_user.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 16]]
---
  def add
    post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 16]]
---
  def remove
    lib_entry = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
   def remove_from_lib
    lib_entry = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def show_post
    # needs to show the particular post
    @post = Post.find params[:id]

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1
---
  def add_image
    image = Image.find params[:id]

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 8]]
---
  def remove_image
    lib_entry = Image.find params[:id]

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1
---
  def show_image
    @image = Image.find params[:id]

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 8]]
---
  def remove_image_from_lib
    lib_entry = Image.find params[:id]