app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."title" ASC
---
  def index
    @posts = Post.all.order(:title)

SELECT "posts".* FROM "posts" WHERE (title like '%bubble%')  ORDER BY created_at DESC
---
  def search
    if params[:search]
      @posts = Post.search(params[:search]).order("created_at DESC")