app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY post.name
---
  def index
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
---
  def show
    @post = Post.find params[:id]

INSERT INTO "posts" ("title", "codepen", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "posts" SET "codepen_embed" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["codepen_embed", "YPErVE"], ["updated_at", "2015-02-09 02:33:59.519294"], ["id", 21]]
---
  def create
    @post = Post.create post_params

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1
UPDATE "posts" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "This is the new title"], ["description", "This is the edited description."], ["updated_at", "2015-02-08 22:41:27.587345"], ["id", 10]]
---
  def update
    post = Post.find params[:id]
    post.update post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]
---
  def destroy
    post = Post.find params[:id]
    post.destroy