app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = 'tom' LIMIT 1
---
  def create
    # return params.inspect
    user = User.find_by :name => params[:username]