app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "users" SET "image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image", "http://xaxor.com/images/Tom-Hanks-is-a-lot-of-animals-meme/Tom-Hanks-is-a-lot-of-animals-meme19.jpg"], ["updated_at", "2015-02-08 01:49:42.117466"], ["id", 13]]
---
  def update
    @user = User.find params[:id]
    @user.update(:image => params[:user][:image], :bio => params[:user][:bio])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "libraries" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-02-08 02:14:52.280825"], ["updated_at", "2015-02-08 02:14:52.280825"]]
UPDATE "libraries" SET "user_id" = $1, "updated_at" = $2 WHERE "libraries"."id" = $3  [["user_id", 15], ["updated_at", "2015-02-08 02:16:08.149632"], ["id", 2]]
---
  def create
    @user = User.create user_params
    @library = Library.create(:user_id => params[:id])
    @user.library = @library

    if @user.save