app/views/images/show.html.erb

<% if @current_user.present? && (@image.user_id != @current_user.id) %>
  <% unless @current_user.library.images.include? @image %>
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."user_id" = $1 LIMIT 1
SELECT "images".* FROM "images" INNER JOIN "images_libraries" ON "images"."id" = "images_libraries"."image_id" WHERE "images_libraries"."library_id" = $1 AND "images"."id" = $2


<% @author = User.find(@image.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1